{
  "ticker": "CRCL",
  "document_type": "S-1",
  "filename": "CRCL_S-1_20250604_104906.html",
  "processed_date": "2025-06-06T07:47:01.107462",
  "sections": {
    "prospectus_summary": "10",
    "risk_factors": "” BEGINNING ON PAGE 34 OF THIS PROSPECTUS. PER SHARE TOTAL INITIAL PUBLIC OFFERING PRICE $ $ UNDERWRITING DISCOUNTS AND COMMISSIONS(1) $ $ PROCEEDS TO US, BEFORE EXPENSES $ $ PROCEEDS TO THE SELLING STOCKHOLDERS, BEFORE EXPENSES $ $ (1) SEE “UNDERWRITING” FOR A DESCRIPTION OF ALL COMPENSATION PAYABLE TO THE UNDERWRITERS. WE HAVE GRANTED THE UNDERWRITERS AN OPTION FOR A PERIOD OF 30 DAYS TO PURCHASE UP TO 4,800,000 ADDITIONAL SHARES OF CLASS A COMMON STOCK TO COVER OVER-ALLOTMENTS. NEITHER THE SECURITIES AND EXCHANGE COMMISSION NOR ANY STATE SECURITIES COMMISSION HAS APPROVED OR DISAPPROVED OF THESE SECURITIES OR DETERMINED IF THIS PROSPECTUS IS TRUTHFUL OR COMPLETE. ANY REPRESENTATION TO THE CONTRARY IS A CRIMINAL OFFENSE. THE UNDERWRITERS EXPECT TO DELIVER THE SHARES TO PURCHASERS ON OR ABOUT     , 2025 THROUGH THE BOOK-ENTRY FACILITIES OF THE DEPOSITORY TRUST COMPANY. J.P. MORGAN CITIGROUP GOLDMAN SACHS & CO. LLC BARCLAYS DEUTSCHE BANK SECURITIES SOCIETE GENERALE BNY CAPITAL MARKETS CANACCORD GENUITY NEEDHAM & COMPANY OPPENHEIMER & CO. SANTANDER AMERIVET SECURITIES DREXEL HAMILTON MISCHLER FINANCIAL GROUP, INC. ROBERTS & RYAN , 2025 TABLE OF CONTENTS CIRCLE TABLE OF CONTENTS MISSIONOUR MISSION IS TO RAISEGLOBAL ECONOMIC PROSPERITYTHROUGH THE FRICTIONLESSEXCHANGE OF VALUE^^GIF YOU COULD TAKE WHAT WE THINK OF AS MONEY, MAKE IT DIGITAL ANDAVAILABLE ON THE INTERNET, THEN THAT WOULD DRAMATICALLY CHANGE THEWAY WE USE MONEY AND OPEN UP OPPORTUNITY AROUND THE WORLD.THATS THE IDEA BEHIND CIRCLE. JEREMY ALLAIRECO-FOUNDER, CHIEF EXECUTIVE OFFICER & CHAIRMAN TABLE OF CONTENTS ABOUT USDCFULLY BACKED DIGITAL DOLLARS1 BUILT FOR RAPID GLOBAL PAYMENTS AND 24/7 FINANCIAL MARKETS, USDC IS A REGULATED DIGITAL CURRENCY THAT IS REDEEMABLE 1:1 FOR US DOLLARS.2 ($)$60B USDC IN CIRCULATION 3 1. FULLY BACKED BY RESERVES CONSISTING OF HIGHLY LIQUID, PRICE-STABLE CASH AND CASH EQUIVALENTS. 2. CIRCLE MINT CUSTOMERS ARE ABLE TO REDEEM USDC DIRECTLY FROM CIRCLE. IN ADDITION, CIRCLE INTERNET FINANCIAL EUROPE SAS IS OBLIGATED UNDERTHE MARKETS IN CRYPTO-ASSETS REGULATION (MICAR\") TO REDEEM ALL USDC PRESENTED TO IT FOR REDEMPTION ON A 1:1 BASIS FOR U.S. DOLLARS, REGARDLESS OF WHETHER THE HOLDER IS A CIRCLE MINT CUSTOMER. AS OF MARCH 31, 2025. TABLE OF CONTENTS USDC LIQUIDITY NEAR-INSTANT SETTLEMENT USDC TRANSACTIONS CAN SETTLE INSECONDS WORLDWIDE. ALL DAY, EVERY DAY. $1T + USDC MINTED AND REDEEMED SINCE FOUNDING4 $25T + USDC LIFETIME ONCHAIN TRANSACTION VOLUME 4 4. AS OF MARCH 31, 2025. TABLE OF CONTENTS CIRCLE PLATFORM ENTERPRISE-GRADE PRODUCTS CIRCLE EMPOWERS DEVELOPERS TO BUILD ONCHAIN PAYMENT SOLUTIONS WITH COMPLIANCE, TRANSPARENCY, AND NEAR-INSTANT PROCESSING. 500+ PARTNERS BUILDING SOLUTIONS WITH US 5 400+ SMART CONTRACTS TRANSACTING WITH USDC 5 20 BLOCKCHAINS WITH NATIVE USDC ISSUANCE 6 $40B+ NATIVE USDC TRANSFERRED BETWEEN BLOCKCHAINS SINCE APRIL 2023 5 5. AS OF MARCH 31, 2025. 6. AS OF MAY 15, 2025. TABLE OF CONTENTS USDC ECOSYSTEM GLOBAL NETWORK & ACCESSIBILITY USDC ENABLES BUSINESSES TO OFFER PAYMENT CONNECTIVITY AND DOLLAR-BACKED FINANCIAL SERVICES TO MORE PEOPLE IN MORE PLACES.185+ COUNTRIES WHERE CIRCLE SUPPORTS WIRE TRANSFERS FOR MINTING AND REDEEMING USDC 7 600M+ END-USER WALLET PRODUCTS WITH ACCESS TO USDC 8 7. CIRCLE MINT IS CURRENTLY AVAILABLE ONLY TO INSTITUTIONS AND IS NOT AVAILABLE TO INDIVIDUALS. 8. AS OF MARCH 31, 2025. TABLE OF CONTENTS TABLE OF CONTENTS FOUNDER’S LETTER 1 GLOSSARY 6 PROSPECTUS SUMMARY 10 RISK FACTORS 33 CAUTIONARY STATEMENT REGARDING",
    "use_of_proceeds": "84",
    "dividend_policy": "85",
    "dilution": "87 MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS 89 BUSINESS 130 MANAGEMENT 168 COMPENSATION DISCUSSION & ANALYSIS 174 CERTAIN RELATIONSHIPS AND RELATED-PARTY TRANSACTIONS 200 PRINCIPAL AND SELLING STOCKHOLDERS 202 DESCRIPTION OF CAPITAL STOCK 207 MATERIAL U.S. FEDERAL TAX CONSIDERATIONS FOR NON-U.S. HOLDERS OF CLASS A COMMON STOCK 216 SHARES ELIGIBLE FOR FUTURE SALE 219 UNDERWRITING 222 CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE 233 LEGAL MATTERS 234 EXPERTS 234 WHERE YOU CAN FIND MORE INFORMATION 235 INDEX TO CONSOLIDATED FINANCIAL STATEMENTS F-1 ON JULY 1, 2024, WE CONSUMMATED AN IRISH HIGH COURT-APPROVED SCHEME OF ARRANGEMENT, PURSUANT TO WHICH ISSUED ORDINARY SHARES AND PREFERRED SHARES IN THE CAPITAL OF CIRCLE INTERNET FINANCIAL LIMITED WERE CANCELLED AND, IN CONNECTION WITH SUCH CANCELLATION, CIRCLE INTERNET GROUP, INC., A DELAWARE CORPORATION, ISSUED AN EQUIVALENT NUMBER OF SHARES OF ITS CAPITAL STOCK OF THE SAME CLASS AND SERIES TO THEN-SHAREHOLDERS OF CIRCLE INTERNET FINANCIAL LIMITED. UPON THE CONSUMMATION OF THE SCHEME OF ARRANGEMENT, CIRCLE INTERNET FINANCIAL LIMITED BECAME A WHOLLY OWNED SUBSIDIARY OF CIRCLE INTERNET GROUP, INC. IN THIS PROSPECTUS, UNLESS OTHERWISE INDICATED OR THE CONTEXT OTHERWISE REQUIRES, “CIRCLE,” THE “COMPANY,” “WE,” “US,” AND SIMILAR TERMS REFER TO (I) PRIOR TO THE CONSUMMATION OF THE SCHEME OF ARRANGEMENT ON JULY 1, 2024, CIRCLE INTERNET FINANCIAL LIMITED AND ITS CONSOLIDATED SUBSIDIARIES AND (II) FOLLOWING THE CONSUMMATION OF THE SCHEME OF ARRANGEMENT ON JULY 1, 2024, CIRCLE INTERNET GROUP, INC. AND ITS CONSOLIDATED SUBSIDIARIES. WE, THE SELLING STOCKHOLDERS AND THE UNDERWRITERS HAVE NOT AUTHORIZED ANYONE TO PROVIDE ANY INFORMATION OR TO MAKE ANY REPRESENTATIONS OTHER THAN THOSE CONTAINED IN THIS PROSPECTUS OR IN ANY FREE WRITING PROSPECTUSES WE HAVE PREPARED. WE, THE SELLING STOCKHOLDERS AND THE UNDERWRITERS TAKE NO RESPONSIBILITY FOR, AND CAN PROVIDE NO ASSURANCE AS TO THE RELIABILITY OF, ANY OTHER INFORMATION THAT OTHERS MAY PROVIDE YOU. I TABLE OF CONTENTS WE AND THE SELLING STOCKHOLDERS ARE OFFERING TO SELL, AND SEEKING OFFERS TO BUY, SHARES OF CLASS A COMMON STOCK ONLY IN JURISDICTIONS WHERE OFFERS AND SALES ARE PERMITTED. THE INFORMATION CONTAINED IN THIS PROSPECTUS IS ACCURATE ONLY AS OF THE DATE OF THIS PROSPECTUS, REGARDLESS OF THE TIME OF DELIVERY OF THIS PROSPECTUS OR ANY SALE OF ANY SECURITIES. OUR BUSINESS, FINANCIAL CONDITION, RESULTS OF OPERATIONS, AND PROSPECTS MAY HAVE CHANGED SINCE THE DATE OF THIS PROSPECTUS. UNTIL      , 2025 (25 DAYS AFTER THE DATE OF THIS PROSPECTUS), ALL DEALERS THAT BUY, SELL, OR TRADE OUR CLASS A COMMON STOCK, WHETHER OR NOT PARTICIPATING IN THIS OFFERING, MAY BE REQUIRED TO DELIVER A PROSPECTUS. THIS IS IN ADDITION TO THE DEALERS’ OBLIGATION TO DELIVER A PROSPECTUS WHEN ACTING AS UNDERWRITERS AND WITH RESPECT TO THEIR UNSOLD ALLOTMENTS OR SUBSCRIPTIONS. TRADEMARKS WE OWN VARIOUS TRADEMARK REGISTRATIONS AND APPLICATIONS, AND UNREGISTERED TRADEMARKS. ALL OTHER TRADE NAMES, TRADEMARKS, AND SERVICE MARKS OF OTHER COMPANIES APPEARING IN THIS PROSPECTUS ARE THE PROPERTY OF THEIR RESPECTIVE OWNERS. SOLELY FOR CONVENIENCE, THE TRADEMARKS AND TRADE NAMES IN THIS PROSPECTUS MAY BE REFERRED TO WITHOUT THE ® AND ™ SYMBOLS, BUT SUCH REFERENCES SHOULD NOT BE CONSTRUED AS ANY INDICATOR THAT THEIR RESPECTIVE OWNERS WILL NOT ASSERT, TO THE FULLEST EXTENT UNDER APPLICABLE LAW, THEIR RIGHTS THERETO. WE DO NOT INTEND TO USE OR DISPLAY OTHER COMPANIES’ TRADEMARKS AND TRADE NAMES TO IMPLY A RELATIONSHIP WITH, OR ENDORSEMENT OR SPONSORSHIP OF US BY, ANY OTHER COMPANIES. MARKET AND INDUSTRY DATA THIS PROSPECTUS INCLUDES INDUSTRY AND MARKET DATA THAT WE OBTAINED FROM PERIODIC INDUSTRY PUBLICATIONS, THIRD-PARTY STUDIES AND SURVEYS, FILINGS OF PUBLIC COMPANIES, AND INTERNAL COMPANY SURVEYS. THESE SOURCES INCLUDE GOVERNMENT AND INDUSTRY SOURCES. INDUSTRY PUBLICATIONS AND SURVEYS GENERALLY STATE THAT THE INFORMATION CONTAINED THEREIN HAS BEEN OBTAINED FROM SOURCES BELIEVED TO BE RELIABLE. ALTHOUGH WE BELIEVE THE INDUSTRY AND MARKET DATA TO BE RELIABLE AS OF THE DATE OF THIS PROSPECTUS, THIS INFORMATION COULD PROVE TO BE INACCURATE. INDUSTRY AND MARKET DATA COULD BE WRONG BECAUSE OF THE METHOD BY WHICH SOURCES OBTAINED THEIR DATA AND BECAUSE INFORMATION CANNOT ALWAYS BE VERIFIED WITH COMPLETE CERTAINTY DUE TO THE LIMITS ON THE AVAILABILITY AND RELIABILITY OF RAW DATA, THE VOLUNTARY NATURE OF THE DATA GATHERING PROCESS, AND OTHER LIMITATIONS AND UNCERTAINTIES. IN ADDITION, WE DO NOT KNOW ALL OF THE ASSUMPTIONS REGARDING GENERAL ECONOMIC CONDITIONS OR GROWTH THAT WERE USED IN PREPARING THE FORECASTS FROM THE SOURCES RELIED UPON OR CITED HEREIN. II TABLE OF CONTENTS FOUNDER’S LETTER TO UNDERSTAND CIRCLE AND ITS POTENTIAL, I WANT TO TAKE YOU THROUGH THE JOURNEY I’VE BEEN ON, HOW IT LED TO THE VISION BEHIND THE FOUNDING OF CIRCLE, AND THE PATH OF EXECUTION THAT LEADS US HERE TOD",
    "capitalization": "86 DILUTION 87",
    "business": "ES TO OFFER PAYMENT CONNECTIVITY AND DOLLAR-BACKED FINANCIAL SERVICES TO MORE PEOPLE IN MORE PLACES.185+ COUNTRIES WHERE CIRCLE SUPPORTS WIRE TRANSFERS FOR MINTING AND REDEEMING USDC 7 600M+ END-USER WALLET PRODUCTS WITH ACCESS TO USDC 8 7. CIRCLE MINT IS CURRENTLY AVAILABLE ONLY TO INSTITUTIONS AND IS NOT AVAILABLE TO INDIVIDUALS. 8. AS OF MARCH 31, 2025. TABLE OF CONTENTS TABLE OF CONTENTS FOUNDER’S LETTER 1 GLOSSARY 6 PROSPECTUS SUMMARY 10",
    "management": ", LLC AND/OR ITS AFFILIATED ENTITIES HAVE INDICATED AN INTEREST IN PURCHASING UP TO $150.0 MILLION OF SHARES OF OUR CLASS A COMMON STOCK BEING OFFERED IN THIS OFFERING AT THE INITIAL PUBLIC OFFERING PRICE AND ON THE SAME TERMS AS THE OTHER PURCHASERS IN THIS OFFERING. HOWEVER, BECAUSE INDICATIONS OF INTEREST ARE NOT BINDING AGREEMENTS OR COMMITMENTS TO PURCHASE, THE UNDERWRITERS COULD DETERMINE TO SELL MORE, FEWER OR NO SHARES TO ANY OF THESE POTENTIAL PURCHASERS, AND ANY OF THESE POTENTIAL PURCHASERS COULD DETERMINE TO PURCHASE MORE, FEWER OR NO SHARES IN THIS OFFERING. UPON COMPLETION OF THIS OFFERING, WE WILL HAVE THREE AUTHORIZED SERIES OF COMMON STOCK: CLASS A COMMON STOCK, WHICH IS ENTITLED TO ONE VOTE PER SHARE; CLASS B COMMON STOCK, WHICH IS ENTITLED TO 5 VOTES PER SHARE (BUT THE AGGREGATE VOTING POWER OF CLASS B COMMON STOCK CANNOT EXCEED 30% OF THE TOTAL VOTING POWER OF OUR CAPITAL STOCK); AND CLASS C COMMON STOCK, WHICH DOES NOT HAVE ANY VOTING POWER OTHER THAN TO THE EXTENT SET FORTH IN OUR CERTIFICATE OF INCORPORATION OR OTHERWISE REQUIRED BY APPLICABLE LAW. HOLDERS OF OUR COMMON STOCK VOTE TOGETHER AS A SINGLE CLASS ON ALL MATTERS, EXCEPT AS OTHERWISE SET FORTH IN OUR CERTIFICATE OF INCORPORATION OR AS REQUIRED BY APPLICABLE LAW. OUR CLASS B COMMON STOCK IS CONVERTIBLE INTO CLASS A COMMON STOCK ON A ONE-FOR-ONE BASIS AT THE OPTION OF THE HOLDER. IN ADDITION, OUR CLASS B COMMON STOCK WILL AUTOMATICALLY CONVERT INTO CLASS A COMMON STOCK ON A ONE-FOR-ONE BASIS UPON ANY TRANSFER, EXCEPT FOR PERMITTED TRANSFERS DESCRIBED IN OUR CERTIFICATE OF INCORPORATION, AND IN CERTAIN OTHER CIRCUMSTANCES. OUR CLASS C COMMON STOCK IS CONVERTIBLE INTO CLASS A COMMON STOCK ON A ONE-FOR-ONE BASIS IN CONNECTION WITH CERTAIN ASSIGNMENTS AND TRANSFERS. OUR CLASS B COMMON STOCK, WHICH WILL BE HELD BY OUR FOUNDERS JEREMY ALLAIRE AND P. SEAN NEVILLE AND CERTAIN ENTITIES CONTROLLED BY OUR FOUNDERS, WILL REPRESENT 30% OF THE TOTAL VOTING POWER OF OUR OUTSTANDING COMMON STOCK FOLLOWING THIS OFFERING (OR 30% OF THE TOTAL VOTING POWER OF OUR OUTSTANDING COMMON STOCK IF THE UNDERWRITERS EXERCISE THEIR OPTION TO PURCHASE ADDITIONAL SHARES IN FULL). UPON THE COMPLETION OF THIS OFFERING, WE WILL NOT BE A “CONTROLLED COMPANY” WITHIN THE MEANING OF THE NYSE’S CORPORATE GOVERNANCE STANDARDS. INVESTING IN OUR CLASS A COMMON STOCK INVOLVES A HIGH DEGREE OF RISK. SEE “RISK FACTORS” BEGINNING ON PAGE 34 OF THIS PROSPECTUS. PER SHARE TOTAL INITIAL PUBLIC OFFERING PRICE $ $ UNDERWRITING DISCOUNTS AND COMMISSIONS(1) $ $ PROCEEDS TO US, BEFORE EXPENSES $ $ PROCEEDS TO THE SELLING STOCKHOLDERS, BEFORE EXPENSES $ $ (1) SEE “UNDERWRITING” FOR A DESCRIPTION OF ALL COMPENSATION PAYABLE TO THE UNDERWRITERS. WE HAVE GRANTED THE UNDERWRITERS AN OPTION FOR A PERIOD OF 30 DAYS TO PURCHASE UP TO 4,800,000 ADDITIONAL SHARES OF CLASS A COMMON STOCK TO COVER OVER-ALLOTMENTS. NEITHER THE SECURITIES AND EXCHANGE COMMISSION NOR ANY STATE SECURITIES COMMISSION HAS APPROVED OR DISAPPROVED OF THESE SECURITIES OR DETERMINED IF THIS PROSPECTUS IS TRUTHFUL OR COMPLETE. ANY REPRESENTATION TO THE CONTRARY IS A CRIMINAL OFFENSE. THE UNDERWRITERS EXPECT TO DELIVER THE SHARES TO PURCHASERS ON OR ABOUT     , 2025 THROUGH THE BOOK-ENTRY FACILITIES OF THE DEPOSITORY TRUST COMPANY. J.P. MORGAN CITIGROUP GOLDMAN SACHS & CO. LLC BARCLAYS DEUTSCHE BANK SECURITIES SOCIETE GENERALE BNY CAPITAL MARKETS CANACCORD GENUITY NEEDHAM & COMPANY OPPENHEIMER & CO. SANTANDER AMERIVET SECURITIES DREXEL HAMILTON MISCHLER FINANCIAL GROUP, INC. ROBERTS & RYAN , 2025 TABLE OF CONTENTS CIRCLE TABLE OF CONTENTS MISSIONOUR MISSION IS TO RAISEGLOBAL ECONOMIC PROSPERITYTHROUGH THE FRICTIONLESSEXCHANGE OF VALUE^^GIF YOU COULD TAKE WHAT WE THINK OF AS MONEY, MAKE IT DIGITAL ANDAVAILABLE ON THE INTERNET, THEN THAT WOULD DRAMATICALLY CHANGE THEWAY WE USE MONEY AND OPEN UP OPPORTUNITY AROUND THE WORLD.THATS THE IDEA BEHIND CIRCLE. JEREMY ALLAIRECO-FOUNDER, CHIEF EXECUTIVE OFFICER & CHAIRMAN TABLE OF CONTENTS ABOUT USDCFULLY BACKED DIGITAL DOLLARS1 BUILT FOR RAPID GLOBAL PAYMENTS AND 24/7 FINANCIAL MARKETS, USDC IS A REGULATED DIGITAL CURRENCY THAT IS REDEEMABLE 1:1 FOR US DOLLARS.2 ($)$60B USDC IN CIRCULATION 3 1. FULLY BACKED BY RESERVES CONSISTING OF HIGHLY LIQUID, PRICE-STABLE CASH AND CASH EQUIVALENTS. 2. CIRCLE MINT CUSTOMERS ARE ABLE TO REDEEM USDC DIRECTLY FROM CIRCLE. IN ADDITION, CIRCLE INTERNET FINANCIAL EUROPE SAS IS OBLIGATED UNDERTHE MARKETS IN CRYPTO-ASSETS REGULATION (MICAR\") TO REDEEM ALL USDC PRESENTED TO IT FOR REDEMPTION ON A 1:1 BASIS FOR U.S. DOLLARS, REGARDLESS OF WHETHER THE HOLDER IS A CIRCLE MINT CUSTOMER. AS OF MARCH 31, 2025. TABLE OF CONTENTS USDC LIQUIDITY NEAR-INSTANT SETTLEMENT USDC TRANSACTIONS CAN SETTLE INSECONDS WORLDWIDE. ALL DAY, EVERY DAY. $1T + USDC MINTED AND REDEEMED SINCE FOUNDING4 $25T + USDC LIFETIME ONCHAIN TRANSACTION VOLUME 4 4. AS OF MARCH 31, 2025. TABLE OF CONTENTS CIRCLE PLATFORM ENTERPRISE-GRADE PRODUCTS CIRCLE EMPOWERS DEVELOPERS TO BUILD ONCHAIN PAY",
    "principal_stockholders": "202",
    "underwriting": "DISCOUNTS AND COMMISSIONS(1) $ $ PROCEEDS TO US, BEFORE EXPENSES $ $ PROCEEDS TO THE SELLING STOCKHOLDERS, BEFORE EXPENSES $ $ (1) SEE “UNDERWRITING” FOR A DESCRIPTION OF ALL COMPENSATION PAYABLE TO THE UNDERWRITERS. WE HAVE GRANTED THE UNDERWRITERS AN OPTION FOR A PERIOD OF 30 DAYS TO PURCHASE UP TO 4,800,000 ADDITIONAL SHARES OF CLASS A COMMON STOCK TO COVER OVER-ALLOTMENTS. NEITHER THE SECURITIES AND EXCHANGE COMMISSION NOR ANY STATE SECURITIES COMMISSION HAS APPROVED OR DISAPPROVED OF THESE SECURITIES OR DETERMINED IF THIS PROSPECTUS IS TRUTHFUL OR COMPLETE. ANY REPRESENTATION TO THE CONTRARY IS A CRIMINAL OFFENSE. THE UNDERWRITERS EXPECT TO DELIVER THE SHARES TO PURCHASERS ON OR ABOUT     , 2025 THROUGH THE BOOK-ENTRY FACILITIES OF THE DEPOSITORY TRUST COMPANY. J.P. MORGAN CITIGROUP GOLDMAN SACHS & CO. LLC BARCLAYS DEUTSCHE BANK SECURITIES SOCIETE GENERALE BNY CAPITAL MARKETS CANACCORD GENUITY NEEDHAM & COMPANY OPPENHEIMER & CO. SANTANDER AMERIVET SECURITIES DREXEL HAMILTON MISCHLER FINANCIAL GROUP, INC. ROBERTS & RYAN , 2025 TABLE OF CONTENTS CIRCLE TABLE OF CONTENTS MISSIONOUR MISSION IS TO RAISEGLOBAL ECONOMIC PROSPERITYTHROUGH THE FRICTIONLESSEXCHANGE OF VALUE^^GIF YOU COULD TAKE WHAT WE THINK OF AS MONEY, MAKE IT DIGITAL ANDAVAILABLE ON THE INTERNET, THEN THAT WOULD DRAMATICALLY CHANGE THEWAY WE USE MONEY AND OPEN UP OPPORTUNITY AROUND THE WORLD.THATS THE IDEA BEHIND CIRCLE. JEREMY ALLAIRECO-FOUNDER, CHIEF EXECUTIVE OFFICER & CHAIRMAN TABLE OF CONTENTS ABOUT USDCFULLY BACKED DIGITAL DOLLARS1 BUILT FOR RAPID GLOBAL PAYMENTS AND 24/7 FINANCIAL MARKETS, USDC IS A REGULATED DIGITAL CURRENCY THAT IS REDEEMABLE 1:1 FOR US DOLLARS.2 ($)$60B USDC IN CIRCULATION 3 1. FULLY BACKED BY RESERVES CONSISTING OF HIGHLY LIQUID, PRICE-STABLE CASH AND CASH EQUIVALENTS. 2. CIRCLE MINT CUSTOMERS ARE ABLE TO REDEEM USDC DIRECTLY FROM CIRCLE. IN ADDITION, CIRCLE INTERNET FINANCIAL EUROPE SAS IS OBLIGATED UNDERTHE MARKETS IN CRYPTO-ASSETS REGULATION (MICAR\") TO REDEEM ALL USDC PRESENTED TO IT FOR REDEMPTION ON A 1:1 BASIS FOR U.S. DOLLARS, REGARDLESS OF WHETHER THE HOLDER IS A CIRCLE MINT CUSTOMER. AS OF MARCH 31, 2025. TABLE OF CONTENTS USDC LIQUIDITY NEAR-INSTANT SETTLEMENT USDC TRANSACTIONS CAN SETTLE INSECONDS WORLDWIDE. ALL DAY, EVERY DAY. $1T + USDC MINTED AND REDEEMED SINCE FOUNDING4 $25T + USDC LIFETIME ONCHAIN TRANSACTION VOLUME 4 4. AS OF MARCH 31, 2025. TABLE OF CONTENTS CIRCLE PLATFORM ENTERPRISE-GRADE PRODUCTS CIRCLE EMPOWERS DEVELOPERS TO BUILD ONCHAIN PAYMENT SOLUTIONS WITH COMPLIANCE, TRANSPARENCY, AND NEAR-INSTANT PROCESSING. 500+ PARTNERS BUILDING SOLUTIONS WITH US 5 400+ SMART CONTRACTS TRANSACTING WITH USDC 5 20 BLOCKCHAINS WITH NATIVE USDC ISSUANCE 6 $40B+ NATIVE USDC TRANSFERRED BETWEEN BLOCKCHAINS SINCE APRIL 2023 5 5. AS OF MARCH 31, 2025. 6. AS OF MAY 15, 2025. TABLE OF CONTENTS USDC ECOSYSTEM GLOBAL NETWORK & ACCESSIBILITY USDC ENABLES BUSINESSES TO OFFER PAYMENT CONNECTIVITY AND DOLLAR-BACKED FINANCIAL SERVICES TO MORE PEOPLE IN MORE PLACES.185+ COUNTRIES WHERE CIRCLE SUPPORTS WIRE TRANSFERS FOR MINTING AND REDEEMING USDC 7 600M+ END-USER WALLET PRODUCTS WITH ACCESS TO USDC 8 7. CIRCLE MINT IS CURRENTLY AVAILABLE ONLY TO INSTITUTIONS AND IS NOT AVAILABLE TO INDIVIDUALS. 8. AS OF MARCH 31, 2025. TABLE OF CONTENTS TABLE OF CONTENTS FOUNDER’S LETTER 1 GLOSSARY 6 PROSPECTUS SUMMARY 10 RISK FACTORS 33 CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS 82 USE OF PROCEEDS 84 DIVIDEND POLICY 85 CAPITALIZATION 86 DILUTION 87 MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS 89 BUSINESS 130 MANAGEMENT 168 COMPENSATION DISCUSSION & ANALYSIS 174 CERTAIN RELATIONSHIPS AND RELATED-PARTY TRANSACTIONS 200 PRINCIPAL AND SELLING STOCKHOLDERS 202 DESCRIPTION OF CAPITAL STOCK 207 MATERIAL U.S. FEDERAL TAX CONSIDERATIONS FOR NON-U.S. HOLDERS OF CLASS A COMMON STOCK 216 SHARES ELIGIBLE FOR FUTURE SALE 219 UNDERWRITING 222 CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE 233",
    "shares_eligible": "219 UNDERWRITING 222 CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE 233",
    "lock_up_agreements": "OR MARKET STANDOFF AGREEMENTS DESCRIBED IN THE “UNDERWRITING” SECTION OF THIS PROSPECTUS BUT WILL BECOME ELIGIBLE TO BE SOLD AT THE EXPIRATION OF THE LOCK-UP PERIOD FOLLOWING THE COMPLETION OF THIS OFFERING. MOREOVER, THE HOLDERS OF APPROXIMATELY 137.7 MILLION SHARES OF CLASS A COMMON STOCK WILL BE ENTITLED TO VARIOUS RIGHTS WITH RESPECT TO THE"
  },
  "metadata": {
    "file_size": 3905227,
    "file_hash": "344e36a90ca5cba21c45e3ded19b9ed7",
    "processing_version": "1.0"
  },
  "key_facts": {
    "company_name": "",
    "ticker": "symbo",
    "exchange": "New York Stock",
    "shares_offered": 12800000,
    "price_range": {
      "min": 0,
      "max": 0
    },
    "underwriters": [
      " COMMISSION HAS APPROVED OR DISAPPROVED OF THESE SECURITIES",
      "CITIGROUP",
      " NEITHER THE SECURITIES",
      " LLC BARCLAYS DEUTSCHE BANK SECURITIES",
      " AND EXCHANGE COMMISSION NOR ANY STATE SECURITIES"
    ],
    "use_of_proceeds": "",
    "lock_up_period": 180,
    "risk_factors_count": 11,
    "voting_structure": "",
    "major_shareholders": [],
    "float_calculation": {
      "shares_offered": 12800000,
      "total_outstanding_pre": 0,
      "total_outstanding_post": 0,
      "float_shares": 0,
      "float_percentage": 0,
      "locked_shares": 0,
      "insider_ownership_pct": 0,
      "calculation_steps": [],
      "sources": []
    }
  },
  "vector_chunks_count": 360,
  "validation_status": "ERROR",
  "validation_notes": "Validation failed: 404 models/gemini-pro is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods."
}