{
  "ticker": "HLEO",
  "company": "Helio Corp. (NYSE-AmEx Uplisting – Unit Deal)",
  "document_type": "S-1",
  "filed_date": "2025-06-04T12:17:26.586875",
  "source_file": "HLEO_S-1_20250604_121726.html",
  "file_size_mb": 0.027980804443359375,
  "sections": {
    "business": "the Company, no par value (“Common Stock”), and one warrant (the “Warrant”) exercisable for one share of Common Stock (the “Warrant Shares”); (ii) the proposed public offering of up to 500,000 shares of common stock (“Over-Allotment Shares”) and/or 500,000 Warrants (“Over-Allotment Warrants”) to purchase 500,000 shares of Common Stock (the “Over-Allotment Warrant Shares”), or any combination thereof, issuable upon exercise of an option (the “Over-Allotment Option”) granted to the underwriters (the “Underwriters”) of the Units in connection with the Offering to cover over-allotments, if any; and (iii) warrants (the “Representative Warrants”) exercisable for a number of shares of Common Stock equal to 5% of the number of Shares and Over-Allotment Shares sold in the Offering (the “Representative Warrant Shares”). The Units are expected to be sold to the several underwriters named in, and pursuant to, an underwriting agreement to be entered into among the Company and the representative (the “Representative”) of the underwriters listed on Schedule 1 thereto, if any (the “Underwriting Agreement”). This opinion letter is furnished in accordance with the requirements of Item 601(b)(5) of Regulation S-K under the Securities Act in connection with the Registration Statement. In connection with this opinion, we have reviewed and relied upon the following: 1.The Registration Statement, including the Preliminary Prospectus; 2.The form of Underwriting Agreement. 3.The form of the Warrant; ",
    "use_of_proceeds": "",
    "risk_factors": [],
    "financial_data": {},
    "lock_up_period": "",
    "offering_price": "",
    "shares_offered": "500,000"
  },
  "processed_at": "2025-06-04T12:17:26.586926",
  "is_real": true
}