{
  "ticker": "CRCL",
  "company": "Circle Internet Corp.",
  "document_type": "S-1",
  "filed_date": "2025-06-04T12:17:20.587986",
  "source_file": "CRCL_S-1_20250604_121718.html",
  "file_size_mb": 3.7243146896362305,
  "sections": {
    "business": "Our business, financial condition, results of operations, and prospects may have changed since the date of this prospectus. Until      , 2025 (25 days after the date of this prospectus), all dealers that buy, sell, or trade our Class A common stock, whether or not participating in this offering, may be required to deliver a prospectus. This is in addition to the dealers’ obligation to deliver a prospectus when acting as underwriters and with respect to their unsold allotments or subscriptions. Trademarks We own various trademark registrations and applications, and unregistered trademarks. All other trade names, trademarks, and service marks of other companies appearing in this prospectus are the property of their respective owners. Solely for convenience, the trademarks and trade names in this prospectus may be referred to without the ® and ™ symbols, but such references should not be construed as any indicator that their respective owners will not assert, to the fullest extent under applicable law, their rights thereto. We do not intend to use or display other companies’ trademarks and trade names to imply a relationship with, or endorsement or sponsorship of us by, any other companies. Market and industry data This prospectus includes industry and market data that we obtained from periodic industry publications, third-party studies and surveys, filings of public companies, and internal company surveys. These sources include government and industry sources. Industry publicat",
    "use_of_proceeds": "Use of proceeds 84 Dividend policy 85 Capitalization 86 Dilution 87 Management’s discussion and analysis of financial condition and results of operations 89 Business 130 <P STYLE=\" margin-top:0pt ; margin-bottom:0pt; margin-left:1.00em; text-indent:-1.00em; fo",
    "risk_factors": [
      "MISSIONOur mission is to raiseglobal economic prosperitythrough the frictionlessexchange of value^^gIf you could take what we think\nof as money, make it digital andavailable on the internet, then that would dramatically change theway we use money and open up opportunity around the world.Thats the idea behind Circle. JEREMY ALLAIRECo-founder, Chief Executive Officer &\nChairman"
    ],
    "financial_data": {},
    "lock_up_period": "180 days (standard)",
    "offering_price": "$27.00",
    "shares_offered": "3,500,000,000"
  },
  "processed_at": "2025-06-04T12:17:20.588178",
  "is_real": true
}