{
  "ticker": "OMDA",
  "company": "Omada Health",
  "document_type": "S-1",
  "filed_date": "2025-06-04T12:17:37.133230",
  "source_file": "OMDA_S-1_20250604_121732.html",
  "file_size_mb": 3.6469078063964844,
  "sections": {
    "business": "Our business, financial condition, and results of operations may have changed since that date. Table of Contents For investors outside the United States: We have not, and the underwriters have not, done anything that would permit this offering or the possession or distribution of this prospectus or any free writing prospectus in connection with this offering in any jurisdiction where action for that purpose is required, other than in the United States. Persons outside the United States who come into possession of this prospectus must inform themselves about, and observe any restrictions relating to, the offering of the shares of common stock and the distribution of this prospectus outside the United States. See the section titled “Underwriters.” THROUGH AND INCLUDING     , 2025 (THE 25TH DAY AFTER THE DATE OF THIS PROSPECTUS), ALL DEALERS THAT BUY, SELL, OR TRADE SHARES OF OUR COMMON STOCK, WHETHER OR NOT PARTICIPATING IN THIS OFFERING, MAY BE REQUIRED TO DELIVER A PROSPECTUS. THIS DELIVERY REQUIREMENT IS IN ADDITION TO THE OBLIGATION OF DEALERS TO DELIVER A PROSPECTUS WHEN ACTING AS UNDERWRITERS AND WITH RESPECT TO THEIR UNSOLD ALLOTMENTS OR SUBSCRIPTIONS. Table of Contents GLOSSARY In this prospectus, we use a number of healthcare industry terms, as well as other terms that are relevant to the delivery of our virtual care programs, as defined below unless otherwise noted or indicated by the context: “A1C” or “hemoglobin A1C” means a measure of an individual’s blood glucose ",
    "use_of_proceeds": "Use of Proceeds 82 Dividend Policy 83 Capitalization 84 Dilution 86 Management’s Discussion and Analysis of Financial Condition and Results of Operations 89 Business 126 <TR STYLE=\"page-break-ins",
    "risk_factors": [],
    "financial_data": {},
    "lock_up_period": "180 days (standard)",
    "offering_price": "$4.74-$12.72",
    "shares_offered": "629,458"
  },
  "processed_at": "2025-06-04T12:17:37.133678",
  "is_real": true
}